/* Кендысь Алексей. Группа 9. Задание 2
Условие:
Решить квадратное уравнение.
Тесты:
2 4 5 - Уравнение не имеет корней
2 4 1 - x1=-0.292893, x2=-1.70711
4 -4 0 - x1=1, x2=0
2 -8 8 - x=2
0 -5 3 - x=0.6
5 0 -14 - x1=1.67332 x2=-1.67332
1.32 4.5 2 - x1=-0.525426 x2=-2.88367
*/
#include <iostream>
using namespace std;
int main()
{
	double a, b, c, D, x1, x2;
	setlocale(LC_ALL, "rus");
	cout << "Введите коэффициенты квадратного уравнения a, b и c\n";
	cin >> a >> b >> c;
	D = pow(b, 2) - 4 * a * c;
	if (a==0 && b==0 && c==0)
	{
		cout << "Уравнение имеет бесконечное количество корней" << endl;
		system("pause");
		return 0;
	}
	if (a == 0 && b == 0)
	{
		cout << "Уравнение не имеет смысла" << endl;
		system("pause");
		return 0;
	}
	if (с == 0 && (b==0 || a==0))
	{
		cout << "Уравнение имеет один корень x = 0" << endl;
		system("pause");
		return 0;
	}
	if (a==0)
	{
		x1 = (-c) / b;
		cout << "Уравнение имеет один корень x = " << x1 << endl;
		system("pause");
		return 0;
	}
	if (D < 0)
	{
		cout << "Уравнение не имеет корней" << endl;
	}
	if (D == 0)
	{
		x1 = b * (-1) / (2 * a);
		cout << "Уравнение имеет один корень x = " << x1 << endl;
	}
	if (D > 0)
	{
		x1 = (b*(-1) + sqrt(D)) / (2 * a);
		x2 = (b*(-1) - sqrt(D)) / (2 * a);
		cout << "Уравнение имеет два корня x1 = " << x1 << " и x2 = " << x2 << endl;
	}
	system("pause");
	return 0;
}