/* Кендысь Алексей. Группа 9. Задание 11
Условие:
Вывести следующую дату после введенной(число, месяц, год)
Тесты:
12.02.2003 - 13.02.2003
29.02.2004 - 01.03.2004
28.02.1900 - 01.03.1900
31.12.2020 - 01.01.2021
31.08.2017 - 01.09.2017
*/

#include<iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int a, b, c, d = 0, e, f;
	cout << "Введите число\n";
	cin >> a;
	cout << "Введите месяц\n";
	cin >> b;
	cout << "Введите год\n";
	cin >> c;
	e = a;
	f = b;
	if ((c % 4 == 0) && (c % 100 != 0))
	{
		d++;
	}
	if (c % 400 == 0)
	{
		d++;
	}
	if ((e == 31) && ((f == 1) || (f == 3) || (f == 5) || (f == 7) || (f == 8) || (f == 10))) 
	{ 
		a=1;
		b++;
	}
	if ((e == 30) && ((f == 4) || (f == 6) || (f == 9) || (f == 11))) 
	{
		a=1;
		b++;
	}
	if ((d>0) && (e == 29) && (f==2)) 
	{ 
		a = 1;
		b++;
	}
	if ((d == 0) && (e == 28) && (f==2)) 
	{ 
		a = 1;
		b++;
	}
	if ((e == 31) && (f == 12)) 
	{ 
		a = 1;
		b = 1;
		c++;
	}
	if ((a!=1) || (e==1))
	{
		a++;
	}
	cout << "Дата следующего дня: ";
	if (a < 10)
	{
		cout << "0";
	}
	cout << a << ".";
	if (b < 10)
	{
		cout << "0";
	}
		cout << b << "." << c << endl;
	system("pause");
	return 0;
}