/* Кендысь Алексей. Группа 9. Задание 4
Условие:
Найти НОД и НОК двух заданных натуральных чисел.
Тесты:
54 24 - нод=6 нок=216
1 5 - нод=1 нок=5
49 49 - нод=49 нок=49
16 37 - нод=1 нок=592
15 70 - нод=5 нок=210
*/
#include <iostream>
using namespace std;
int main()
{
	int a, b, c;
	setlocale(LC_ALL, "rus");
	cout << "Введите два числа\n";
	cin >> a >> b;
	c = a;
	while (a%c != 0 || b % c != 0)
	{
		c--;
	}
	cout << "НОД этих двух чисел равен " << c << ", а их НОК равен " << (a*b) / c << endl;
	system("pause");
	return 0;
}